[{"title": "Critiquing SEBI’s Narrow Interpretation of the Inter-Se Transfer Exemption", "content": "\n[Simran Sharma is a fourth year B.A.,LL.B (Trade and Investment Law Hons.) student at National Law University, Jodhpur} The Securities and Exchange Board of India (SEBI) provided informal guidance in June this year on the interpretation of the “inter se transfer exemption” under the SEBI (Substantial Acquisition of Shares and Takeovers) Regulations, 2011 (“Takeover Code”). This post aims to...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Capital Reduction: Tax Conundrums", "content": "\n[Sumit Bansal (Partner), Shivani Chhabra (Associate) and Taranjeet Singh (Associate) are with S&R Associates, Advocates] Capital reduction refers to the technique of reducing a company’s share capital in any form. It is a mechanism usually adopted by companies for re-modelling their capital structure, amongst other means (viz., buy-back of shares and redemption of preference share capital)...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Tussle for Jurisdiction: CCI vs. The Controller General of Patents", "content": "\n[Jishnudeep Kolay and Saumya Bapna are second-year B.A. LL.B (Hons.) students at the National Law School of India University, Bengaluru] In July 2023, the Delhi High Court in Telefonaktiebolaget LM Ericsson v. Competition Commission of India (‘Ericsson II’) ruled that in an issue of abuse of dominance by a patentee in the exercise of their rights under the patent, the Patents Act, 1970 will...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Supreme Court’s Caution against an Infinite Corporate Insolvency Resolution Process", "content": "\n[Praveen Sharma is a 5th Year Student at MNLU Mumbai] Earlier this month, in RPS Infrastructure Ltd. v. Mukul Kumar (2023INSC816), the Supreme Court addressed a crucial issue concerning the timing of claims in the corporate insolvency resolution process (CIRP). The Court was deciding on the question of whether a claim relating to an arbitral award, undergoing an appeal process under section 37 of...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Establishing Performance Validation Agency: Examining SEBI’s Consultation Paper", "content": "\n[Daksh Kasliwal and Prakhar Singh are 3rd year BSW LL.B. (Hons.) students at Gujarat National University, Gandhinagar] Recently, the Securities and Exchange Board of India (SEBI) has taken multiple steps to enhance the regulatory landscape to foster a more reliable and secure market environment for investors and entrepreneurs. Weeks after releasing a consultation paper to control unregistered...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Navigating the Data Integration Conundrum: A Closer Look at IBC", "content": "\n[Aayushi Choudhary and Vaibhav Gupta are fourth year students of Gujarat National Law University, Gandhinagar] The Insolvency and Bankruptcy Code, 2016 (IBC) brought about a major change in the landscape of corporate insolvency proceedings in the country. Nevertheless, despite the IBC’s transformative potential, its effective implementation has been hampered by a significant challenge: the...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Analysing the Tax Implications of Bonus Shares", "content": "\n[Arjim Jain is a 3rd year B.A. LL.B. (Hons.) student at National Law University, Odisha] The ruling in DCIT v. Smt Aruna Chandok rendered on 5 September 2023 by the Delhi Bench of the Income Tax Appellate Tribunal (“ITAT”) has shed light on a crucial aspect of taxation in India – the treatment of bonus shares under the Income Tax Act (“IT Act”). In this landmark decision, the ITAT has...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "A Bank’s Post-Merger Liability for Pre-Merger Crimes", "content": "\nEarlier this month, the Supreme Court in Religare Finvest Limited v. State of NCT of Delhi (2023INSC819) considered the question whether the transferee bank in a merger can be fastened with corporate criminal liability for offences committed by the officials of the transferor bank prior to a merger of the two entities. The Court answered in the negative given the specific facts and circumstances...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Restoring Equity: Supreme Court on Liquidator Discretion in IBC Bidding Process", "content": "\n[Priyanshu Mishra is a III year BA, LLB (Hons) student at the National Law School of India University, Bengaluru] Recently, in Eva Agro Feeds Pvt Ltd v Punjab National Bank (2023INSC809), the Supreme Court decisively clarified the extent of authority granted to a liquidator in rejecting the final bid within an online bidding process. This legal dispute revolved around the rights of the highest...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "SC Expands Scope of Enquiry under Section 11 of the Arbitration Act", "content": "\n[Raghav Bhatia is an advocate practising at the Supreme Court of India. He can be contacted at [email protected]] In April this year, the Supreme Court of India in NTPC Ltd. v. SPML Infra Ltd. has expanded the scope of enquiry to be exercised by a court while referring the disputes for arbitration under section 11 of the Arbitration and Conciliation Act, 1996 (‘Arbitration Act’). Background...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "SEBI’s Proposed Regulations on Finfluencers: Navigating Unresolved Practicalities", "content": "\n[Aamir Kapadia and Avinash Kotval are penultimate and final year BBA LL.B. (Hons.) student at Jindal Global Law School, Sonipat, respectively] On August 25, 2023, the Securities and Exchange Board of India (‘SEBI’) released a consultation paper on ‘Association of SEBI Registered Intermediaries/Regulated Entities with Unregistered Entities (including Finfluencers)’. The purpose behind the...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Receipt of Demand Notice under IBC: Whether Price Sensitive Information?", "content": "\n[Ravishekhar Pandey and Amarpal Singh Dua are with MDP & Partners, Mumbai] The Securities Exchange Board of India (“SEBI”) on 12 July 2023 passed an order relating to the scrip of Shilpi Cable Technologies Limited (“STCL”) imposing penalty on the Managing Director (“MD”) as well as the Compliance Officer for violations of securities laws. In the order, the Adjudicating Officer (“AO”)...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Unwinding and Rewinding the Clock: Revisiting Interim Reliefs under Section 9 of the Arbitration Act", "content": "\n[Sumit Chatterjee is an Advocate at Arista Chambers, Bangalore] Interims reliefs under the Arbitration and Conciliation Act, 1996 (“Act”) underwent a significant change following the Arbitration and Conciliation (Amendment) Act, 2015 (“2015 Amendment”). Under the Act, parties can approach the Court under section 9 of the Act to seek interim reliefs before, or during the arbitral proceedings, or...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Hybrid Settlements and Presumption of Innocence: The Conundrum of Verdict Under Veil", "content": "\n[Ishita Mishra is a fourth-year B.B.A. LL. B (Hons.) student at Symbiosis Law School, Pune] The European Commission (‘Commission’) issued its decision to establish the participation of Barclays, Deutsche Bank, RBS, and Société Générale in a cartel in the market for Euro Interest Rate Derivatives (‘EIRD’). The decision was adopted through a settlement procedure wherein the banks received a 10%...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Evaluating India’s Regulatory Regime for ESG Rating Agencies", "content": "\n[Shouvik Kumar Guha is an Associate Professor of Law and Sourav Paul a fourth year undergraduate student, both at the West Bengal National University of Juridical Sciences, Kolkata] On July 3, 2023, the Securities and Exchange Board of India (‘SEBI’), introduced the Securities and Exchange Board of India (Credit Rating Agencies) (Amendment) Regulations, 2023 (‘Regulation’) to amend the Securities...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "ITC-J&J Deal: Unravelling the Complexities of NCLAT’s Decision in the Merger Control Regime", "content": "\n[Aryan Birewar, Rishabh Guha, and Dhanshitha Ravi are 4th Year BBA LLB (Hons.) students at Symbiosis Law School, Pune]  On 27 April 2023, the National Company Law Appellate Tribunal (“NCLAT”) passed an Order (“the Order”) favouring ITC Pvt. Ltd., reversing the penalty that was levied on it by the Competition Commission of India (“CCI”) for not notifying a combination under section 43A of the...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Company’s Interest vs Duty to Protect the Environment – A Director’s Balancing Act", "content": "\n[Abhijnan Jha is a partner and Urvashi Misra is a senior associate at AZB & Partners, New Delhi] In April 2022, António Guterres, United Nations Secretary-General, drew the world’s attention to the alarming findings of the Intergovernmental Panel on Climate Change in its third report. Concerned that major emitters were not taking requisite steps to fulfil their climate pledges, the Secretary...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Rajasthan’s Gig Workers’ Legislation: Paving the Way for Transformation?", "content": "\n[Esha Rathi is a final year B.B.A. LL.B. (Hons.) student at Jindal Global Law School.] Rajasthan has taken the lead as the first Indian state to regulate and support the burgeoning gig economy workforce through a comprehensive legal framework titled “Rajasthan Platform Based Gig Workers (Registration and Welfare) Act, 2023” (Act), the Bill for which was brought before the Rajasthan Legislative...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Supreme Court Holds Maternity Benefits Could Extend Even Beyond Contractual Term ", "content": "\n[Lavanya Chawla is an Associate at J-Law Offices, New Delhi.] A three Judge bench of the Supreme Court in Dr. Kavita Yadav v The Secretary, Ministry of Health and Family Welfare Department & Ors (17 August 2023) held that if a woman has worked in an establishment for 80 days, she would be eligible for full maternity benefits, even if such benefits exceed the term of contract. Facts An...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Navigating the Regulatory Landscape: ICAI and CCI at Loggerheads over CPE Program", "content": "\n[Shruti Srivastava is a fourth-year law student from National Law University and Judicial Academy, Assam] Delegated legislation is a vital framework that allows specialized bodies like the Institute of Chartered Accountants of India (ICAI) to regulate their respective professions effectively. As a statutory body, the ICAI derives its regulatory authority from the Chartered Accountants Act 1949...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "An Exercise in Smoke and Mirrors: Imposing a “Goods” Tax on Actionable Claims", "content": "\n[Anushka PS is a third-year student pursuing the BA/LLB (Hons.) course from the National Law School of India University, Bangalore] The imposition of tax in the gaming industry is an issue that has long plagued both stakeholders and academics alike. With the Parliament tabling an amendment to the Central Goods and Services Tax Act, 2017 (the ‘CGST Act’) to precipitate the levy of 28% goods and...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Decoding “Ordinary Course of Business” in M&A Transactions", "content": "\n[Rajat Sethi is a Partner and Oorja Chari an Associate at S&R Associates] In common parlance, transactions entered in the “ordinary course of business” include transactions carried out in the day-to-day course of business to further the company’s business, in line with its charter documents. Black’s Law Dictionary defines ordinary course of business as “normal routine in managing trade or...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Mediation Dreams, Legislative Realities: Analysing the Mediation Bill, 2023", "content": "\n[Akarshi Narain and Gayatri Kondapalli are 3rd-year B.A., LL.B. (Hons.) students at NALSAR University of Law, Hyderabad] Mediation, as a mode of alternative dispute resolution, has increasingly been gaining traction in the international sphere. The Singapore Convention on Mediation, adopted in 2018, envisages cross-border enforcement of settlement agreements similar to that of arbitral awards...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "Harmonious Dispute Resolution: Unveiling India’s Mediation Bill 2023", "content": "\n[Esha Rathi is a final year B.B.A. LL.B. (Hons.) student at Jindal Global Law School.] In a significant leap towards modernizing the legal framework and expediting the resolution of civil and commercial disputes, the Rajya Sabha recently passed the Mediation Bill 2023. This pioneering legislation marks a crucial shift, elevating mediation as the primary avenue for dispute resolution, prior to...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "‘Enabling’ Provisions of PMLA: Casting a Net Too Wide?", "content": "\n[Bhamini Tanwani and Vanshika Manglani are fourth-year B.A. LL.B. (Hons.) students at Hidayatullah National Law University, Raipur] The High Court of Delhi (‘the Court’) in case of PayPal Payments Private Limited v. Financial Intelligence Unit Indiaheld that payment platform PayPal is included in the definition of ‘payment system operator’ under the Prevention of Money Laundering Act, 2002...\n", "timestamp": "2023-09-29T16:30:01.053778"}, {"title": "SC Ruling in Paschimanchal Vidyut: Analyzing the Treatment of Statutory Dues as Secured Credit", "content": "\n[Rakshit Agarwal and Tarun Ashok are third-year B.A. LL.B. (Hons.) student at the National Law School of India University, Bangalore] The recent judgment by a division bench of the Supreme Court of India in Paschimanchal Vidyut Vitran Nigam Ltd v Raman Ispat Private Limited (‘PVVNL’) has, as we argue, settled the debate on whether statutory dues are to be considered as secured credit for the...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "A Re-Examination of the First Principles of Sections 28 and 37 of the Income Tax Act: Part II", "content": "\n[Rucha A Vaidya is an Advocate, Bombay High Court. The author would like to thank Mr. Mihir Naniwadekar, Advocate Bombay High Court, for his comments on the earlier draft of this post. Part I is available here] Having considered the facts and the judgments of Shah and Sundresh JJ in PCIT v. Prakash Chand Lunia in the earlier part, this post will analyse the underlying issue concerning sections 28...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "A Re-Examination of the First Principles of Sections 28 and 37 of the Income Tax Act: Part I", "content": "\n[Rucha A Vaidya is an Advocate, Bombay High Court. The author would like to thank Mr. Mihir Naniwadekar, Advocate Bombay High Court, for his comments on the earlier draft of this post] This is a two-part post on a judgment of the Supreme Court of India (SC) in PCIT v. Prakash Chand Lunia (24 April 2023), which provides an opportunity for closely examining some of the fundamental principles...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Snake Oil or Standards: A Critical Analysis of SEBI’s Index Provider Regulation", "content": "\n[Ritvij Ratn Tiwari is a 4th-year B.A., LL.B. (Hons.) student at the National Law School of India University, Bangalore] The Securities and Exchange Board of India’s (“SEBI”) recent decision to withhold its proposal for regulating index providers has placed the spotlight on a significant juncture in the regulatory landscape surrounding the financial markets in India. In December last year, SEBI...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "NCLT Order in Zee-Sony Merger Reiterates High Onus on Objectors", "content": "\nThe proposed merger of Zee Entertainment Enterprises Limited with Sony’s India operations (through its entity Culver Max Entertainment Private Limited) has attracted considerable attention. This is essentially due to some governance and financial circumstances surrounding the Zee group. Zee Entertainment was the subject matter of shareholder activism spearheaded by an institutional investor...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "NCLAT’s Verdict Reshapes the Interplay Between Arbitration and Insolvency", "content": "\n[Mohammad Kaif is a final year student at Campus Law Centre, Faculty of Law, University of Delhi] The judgment of the National Company Law Appellate Tribunal (NCLAT) Chennai Bench in KK Ropeways Limited v. Billion Smiles Hospitality has significant implications for the interplay between arbitration and insolvency proceedings in India. The central question addressed by the NCLAT was whether a...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Reinforcing Secured Creditors’ Rights: Insights from the Ronak Industries Case", "content": "\n[Shruti Srivastava is a 4th year B.A., LL.B. (Hons.) student at National Law University and Judicial Academy, Assam] In the ever-evolving landscape of financial regulations, the concept of a secured creditor has assumed significant importance. A momentous shift occurred with the introduction of section 26-E in The Securitization and Reconstruction of Financial Assets and Enforcement of Security...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "IBC Overrides Electricity Act: Capturing the Fallacy in Rainbow Papers", "content": "\n[Praveen Sharma is a 5th Year Student at MNLU Mumbai] Recently in Paschimanchal Vidyut Vitran Nigam Ltd. v. Raman Ispat Private Limited, the Supreme Court of India ruled that the Insolvency and Bankruptcy Code, 2016 (IBC) overrides the Electricity Act, 2003. While dismissing the appeal of Paschimanchal Vidyut Vitran Nigam Limited (PVVNL), the Court provided crucial clarification regarding the...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Mandatory Arbitration Clauses: A Threat to Labour in India?", "content": "\n[Nankee Arora is a fourth-year law student at Jindal Global Law School] Mandatory arbitration clauses have become increasingly prevalent in employment contracts around the world. Employers seek to bind their employees to arbitration from the inception of their employment contract so in the event a claim arises they can take recourse to the speedier but more importantly confidential and largely...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "PSUs and Competition Law in India: Balancing Public Interest and Market Efficiency", "content": "\n[Himanshi Yadav and Kartikey Baid are 4th Year B.A., LL.B. (Hons.) students at National Law University, Jodhpur] In the contemporary era of interconnected global trade and commerce, the principles of free and  fair competition among not only private enterprises but also public and private sectors have become synonymous with a well-functioning free market. Consequently, the intersection of...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Unraveling SEBI’s Ex-parte Interim Orders: A Critical Analysis of the Zee Entertainment Case", "content": "\n[Tanuj Sharma is a 5th year B.B.A. LL.B. (Hons.) student and Vanshika Sharma is a 4th year B.B.A. LL.B. (Hons.) student at National Law University Odisha] The Securities Appellate Tribunal (“SAT”) on 10 July 2023 upheld the decision of the Securities and Exchange Board of India (“SEBI”) barring Subhash Chandra, the then Chairman of Zee Entertainment Enterprises Ltd. (“ZEEL”), and Puneet Goenka...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Evaluating SEBI’s Fit & Proper Test: Striking the Right Balance", "content": "\n[Dhaval Bothra and Akshat Jain are law students at Symbiosis Law School Pune and National Law University Delhi, respectively] Trust remains the cornerstone in matters of public money, and the Securities and Exchange Board of India (“SEBI”) is the watchdog of this trust. In furtherance of this aim, almost two years ago, the SEBI introduced amendments to the “fit and proper rule” under the...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Digital Personal Data Protection Bill: Balancing Privacy and Innovation ", "content": "\n[Ananya Karnwal and Astha Agarwal are 5th year B.A. LL.B (Hons.) students at National Law University Odisha in Cuttack, Odisha] Recently, on 5 July 2023 the Digital Personal Data Protection Bill (“The Bill”) received approval from the Central Cabinet. This Bill has been finalized after multiple attempts of the government to create a holistic legislation to govern digital data of individuals that...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Adducing Additional Evidence under Section 34 of the Arbitration and Conciliation Act", "content": "\n[Raghav Bhatia is an Advocate practising at the Supreme Court and Delhi High Court. He can be contacted at [email protected].] Early this year, the Supreme Court of India in Alpine Housing Development Corporation Pvt. Ltd. v. Ashok S. Dhariwal reiterated that only in exceptional circumstances can a party adduce additional evidence under section 34 of the Arbitration and Conciliation Act...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Strengthening AIF Governance: SEBI’s Pro-Rata Proposal", "content": "\n[Sagun Modi is a 4th Year B.A. LL.B. (Hons.) student at National Law University, Odisha] Alternative investment funds (‘AIFs’) have emerged as vital investment vehicles in the global financial landscape. They provide investors with diversified investment opportunities beyond traditional asset classes. India witnessed a 30% increase in investment commitments into AIFs, from Rs. 6.41 trillion in...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Commercial Wisdom of the Committee of Creditors: An End to Excessive Deference?", "content": "\n[Mathanki Narayanan is a 4th year B.A. L.L.B. (Hons.) student at Jindal Global Law School] The conceptualization of the Insolvency and Bankruptcy Code, 2016 (IBC) was underpinned by the need to preserve economic value through expediency. However, its implementation has revealed asymmetries of power amongst the creditors. The Committee of Creditors (CoC) spearheads the Corporate Insolvency...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Game On, Taxes Doubled: Unraveling the Dual Taxation Conundrum in India’s Online Gaming Industry: Part II", "content": "\n[Rupam Dubey and Parth Kantak are 3rd-year B.A., LL.B. (Hons.) students at the National Law School of India University, Bangalore This is a continuation of Part I] The preceding segment of this post examined the taxation framework enforced upon the realm of online gaming in India and the dual taxation regime of the Union Government which leads to a situation of double taxation, imposing an unfair...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Game On, Taxes Doubled: Unraveling the Dual Taxation Conundrum in India’s Online Gaming Industry: Part I", "content": "\n[Rupam Dubey and Parth Kantak Mangrish are 3rd-year B.A., LL.B. (Hons.) students at the National Law School of India University, Bangalore] The emergence of affordable internet in India has had a profound impact on the country’s mobile gaming industry. With increased accessibility to the internet, more people have been able to engage in online gaming, resulting in India becoming one of the...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "SEBI Circular on ESG Disclosures of Value Chains: A Double-Edged Sword", "content": "\n[Avani Hegde and Praneel Panchagavi are 3rd year B.A., LL.B. (Hons.) students at Symbiosis Law School, Pune] The Securities and Exchange Board of India (SEBI) issued a circular on July 12, 2023 notifying the mandate for environmental, social, and governance (ESG) disclosures and assurance requirements for value chains of the top 250 listed entities by market capitalization from the financial year...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Balancing Review and Recall: NCLAT on Correction of Procedural Errors", "content": "\n[Basil Gupta is a 4th year B.A., LL.B. (Hons.) student at National Law University, Jodhpur] The National Company Law Appellate Tribunal (NCLAT) has clarified that it possesses the power to recall its judgments, asserting its inherent authority under Rule 11 of the NCLAT Rules, 2016. In a significant decision, a five-member bench of the NCLAT in Union Bank of India (Erstwhile Corporation Bank) v...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "SEBI’s Sponsorship Shake-Up: Unravelling the Implications for Mutual Funds", "content": "\n[RS Sanjanaa is a third-year BA LLB (Hons.) student at Symbiosis Law School, Pune] A sponsor of a mutual fund refers to any bank, financial institution or a corporate who acts as the promoter of the mutual fund. The entity establishes the fund, obtains necessary approvals and funding, and incorporates an asset management company (“AMC”). On June 27, 2023, the Securities and Exchange Board of...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Identifying Senior Managers: Revisions to Listing Rules", "content": "\n[Pammy Jaiswal and Mahak Agarwal are with Vinod Kothari & Co] The concepts of senior management (‘SM’) and senior managerial person or personnel (‘SMP’ or ‘SMPs’) was not present under the regime established by the Companies Act, 1956, and it was first introduced in section 178 of the Companies Act, 2013 (the ‘Act, 2013’). The law requires the nomination and remuneration committee to...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Revival of Time-Barred Debts", "content": "\n[Mihir Modi is an Associate with PSL Advocates and Solicitors in Mumbai] According to the Limitation Act 1963 (‘the Limitation Act’), there is a set time limit for filing appeals and instituting lawsuits in various courts. The Limitation Act is based on the idea that there must be a strict time limit for bringing appropriate actions in the courts. In doing so, it protects only the diligent...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Corporate Climate Litigation: Comparing ClientEarth-Shell with the Indian Regulatory Framework", "content": "\n[Dhanshitha Ravi and Santosh S are third and final year law students respectively at Symbiosis Law School, Pune] The United Kingdom High Court (“UKHC”) on the 12 May 2023 delivered a landmark judgment in the realm of corporate jurisprudence in a first of its kind climate-change based derivative action in ClientEarth v. Shell plc. This action was brought by ClientEarth, a minority shareholder in...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Balancing Contractual Autonomy vis-à-vis Application of Section 74 of the Contract Act, 1872: Part II", "content": "\n[Lavanya Pathak and Pallavi Mishra are advocates practicing at the Delhi High Court. This is a continuation from Part I] Position Taken by High Courts at Bombay, Delhi and Madras The recent judgements rendered by High Courts at Bombay, Delhi and Madras (discussed below) are instructive when it comes to offering clarity on the SC’s understanding of the law on liquidated damages and penalties. In...\n", "timestamp": "2023-09-29T16:30:01.502601"}, {"title": "Balancing Contractual Autonomy vis-à-vis Application of Section 74 of the Contract Act, 1872: Part I", "content": "\n[Lavanya Pathak and Pallavi Mishra are advocates practicing at the Delhi High Court.] The concept of ‘liquidated damages’ and ‘penalty’ was originally intended to be omitted from the realm of the Indian law by careful usage of the phrase “sum named in the contract” under section 74 of the Contract Act, 1872 (“Contract Act”). However, following the amendment brought about in 1899, the scope of...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "CCI’s Inconsistent Stance on Acquisition of Optionally Convertible Securities: Reconciling Control and Competition", "content": "\n[Arham Anwar and Ruby Agrawal are 4th year and 2nd year students of NLU Jodhpur and RGNUL Patiala] The scheme of arrangements contemplated under the Companies Act, 2013 generally requires the approval of the Competition Commission of India (hereinafter, “CCI”) in relation to asset size and turnover of the enterprise. This essentially underlines high level of dependability the company has on the...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Fine-Tuning the FLDG Framework: Sectoral Caps Reflecting Default Rate Variations", "content": "\n[Ritvij Ratn Tiwari is a 3rd-year B.A., LL.B. (Hons.) student at the National Law School of India University, Bangalore.] In June 2023, the Reserve Bank of India (“RBI”) issued guidelines regulating the arrangements for sharing the losses arising from defaulted loans, popularly called default loss guarantee (“DLG”), between regulated entities (“REs”) and lending service providers (“LSPs”). These...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Section 241 of the Companies Act, 2013: An Avenue for Derivative Actions", "content": "\n[Rakshit Agarwal is a 2nd Year Student at the National Law School of India University, Bangalore] The judgment of the Delhi High Court in ICP Investments v Uppal Housing Pvt Ltd has spurred the debate as to whether section 241 of the Companies Act 2013 (“Act”) is the appropriate provision under which derivative actions can be instituted. The decision in ICP Investments to include derivative...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "SEBI’s Order on Spoofing – A Way Forward", "content": "\n[Shivangi Paliwal and Mahak Shinghal are final year B.A. LL.B. (IPR Hons.) and B.B.A. LL.B. (IPR Hons.) students at National Law University, Jodhpur] Section 12A of the Securities and Exchange Board of India Act, 1992 [“SEBI Act”] read along with Regulation 3 & 4 of SEBI (Prohibition of Fraudulent and Unfair Trade Practices relating to Securities Market) Regulations, 2003 [“PFUTP...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Regulating the Regulator: A Prohibited Territory for the CCI", "content": "\n[Shourya Mitra is a penultimate year law student at Jindal Global Law School, Sonipat] On 2 June 2023, the Delhi High Court, in the case of Institute of Chartered Accountants of India (“ICAI”) v. CCI, held that the Competition Commission of India (“CCI”) lacks jurisdiction to assess grievances arising from a statutory regulator’s decisions. It held that the CCI could not compel or outsource...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Put Options: Putting Up with Foreign Exchange Regulation", "content": "\n[Ryan Joseph is a 3rd year B.B.A., LL.B. (Hons.) student at Jindal Global Law School] A decision of the Madras High Court in January this year in GPE (India) Limited v. Twarit Consultancy has added to the controversial debate over the enforcement of put options that guarantee assured returns. The High Court toed the line with other courts and upheld an arbitral award, notwithstanding the...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Reimagining the Insolvency Process: A Case of Multiple Resolution Plans", "content": "\n[Piyush Kr. Choubey and Kaustubh Kumar are 4th year students at the National University of Study and Research in Law, Ranchi] The Ministry of Corporate Affairs (“MCA”) in January 2023 floated a discussion paper on possible changes to the Insolvency and Bankruptcy Code, 2016 (the “Code”). One of the topics in the discussion paper was “Reimagining the consideration of the resolution plan and the...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Securing Borrowers, Shielding Lenders: RBI’s Default Loss Guarantee Regulations", "content": "\n[RS Sanjanaa is a 3rd year BA LLB (Hons.) student at Symbiosis Law School, Pune] The Reserve Bank of India (RBI) has granted approval to and released guidelines (on June 8, 2023) on the much-contended topic of default loss guarantee (DLG). A DLG model according to this refers to the default loss cover provided to a bank or non-banking finance company (NBFC) by the fintech company that was the...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "SEBI’s Reforms for REITs/InvITs: Assessing the Broader Corporate Governance Concerns", "content": "\n[Nikhil Javali is a 4th year B.B.A. LL.B. student at National Law University Odisha] As real estate investment trusts (‘REITs’) and infrastructure investment trusts (‘InvITs’) gain global recognition as a powerful investment vehicle, India is taking significant strides towards aligning its REIT/InvIT regulations with global best practices. Across the world, REITs have emerged as a dominant...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Stricter Framework for Sale, Lease or Disposal of Undertaking by a Listed Entity", "content": "\n[Nitu Poddar is a Partner at Vinod Kothari and Company, and can be reached at [email protected]] Disposal of an undertaking (whole or substantially the whole) can be carried out either as part of a scheme of arrangement or otherwise by way of slump sale or business transfer agreement (‘BTA’). Disposal, other than by way of scheme of arrangement, has so far been regulated according to...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Call for Submissions: Trade, Law and Development", "content": "\n[Announcement on behalf of Trade, Law and Development] Founded in 2009, the philosophy of Trade, Law and Development (TL&D) has been to generate and sustain a constructive and democratic debate on emergent issues in international economic law and to serve as a forum for the discussion and distribution of ideas. Towards these ends, the Journal has published works by noted scholars such as the...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Call for Papers: NLUJ Law Review", "content": "\n[Announcement on behalf of the NLUJ Law Review] NLUJ Law Review is the flagship journal of National Law University, Jodhpur, established with the objective of promoting academic research and fostering debate on contemporary legal issues. It is a bi-annual, double-blind student reviewed and edited journal, focusing on an inter-disciplinary approach towards legal writing. The remit of the Reviewis...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Private Equity Firms and the Liability Puzzle of their Subsidiaries", "content": "\n[Rupam Dubey is a 2nd year B.A.LLB student and Hrithik Merchant a 4th year B.A.LLB student, both at the National Law School of India University Bangalore] The traditional essence of private equity was rooted in the strategy of acquiring companies for the purpose of selling them, while remaining detached from the day-to-day operations of the portfolio company. However, the landscape of modern...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Call for Papers by RMLNLU Law Review Volume XIV", "content": "\n[Announcement on behalf of Dr. Ram Manohar Lohiya National Law University] Dr. Ram Manohar Lohiya National Law University (RMLNLU) is a public law school and a National Law University located in Lucknow, Uttar Pradesh, India. It was established as Dr. Ram Manohar Lohiya National Law Institute in 2005, and since then, has been providing undergraduate and post-graduate legal education. It ranks...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Analysis of SAT Order: Appointment of Independent Director Above 75 years", "content": "\n[Gaurav Pingle is a practising company secretary and can be reached at [email protected]] Considering the importance of independent directors on the boards of listed entities, the Securities and Exchange Board of India (“SEBI”) has been amending the provisions relating to their appointment, re-appointment, appointment process, remuneration, and the like under the SEBI (Listing Obligations and...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Karvy Demat Case: How has SEBI Responded?", "content": "\n[Anant Budhraja and Praneeta Tiwari are 5th year BA-LLB (Hons.) students at West Bengal National University of Juridical Sciences] The Securities and Exchange Board of India (“SEBI”) on April 28, 2023, passed a stringent final order against Karvy Stock Broking Limited (“KSBL”) and its promoter Comandur Parthasarthy, whereby it banned them from accessing the securities market for seven years...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "PMLA Framework on Virtual Digital Assets: Two Key Issues", "content": "\n[Jaideep Reddy is Counsel and Krati Hashwani a Senior Associate, Trilegal] The virtual digital asset (also known as crypto-asset or cryptocurrency) (VDA) industry is accustomed to legal ambiguity in India. There has been little in the way of legislative clarity, barring the specific income-tax regime introduced in 2022, and piecemeal measures such as a mandatory disclosure of holdings for...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Empirical Analysis of Legal Fees Data for Indian Companies", "content": "\n[Srinivasan Sankaraguruswamy is an Associate Professor of Accounting at the NUS Business School, National University of Singapore and Umakanth Varottil is an Associate Professor at the Faculty of Law, National University of Singapore] A significant challenge confronts legal departments of companies. On the one hand, the demand for legal services from external counsel continues to skyrocket given...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Material Adverse Government Action (MAGA): Need for a PPP Framework in India", "content": "\n[Sri Janani S. is a 3rd year B.A., LL.B. (Hons.) student at National Law University, Jodhpur] In the recent years, public-private partnerships (“PPPs”) have been increasing manifold in India. The state is recognizing the private sector’s indispensable role in the infrastructure sector, urban water projects, healthcare and even in the development of electric vehicles. The Government is encouraging...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "ClientEarth-Shell: English Court Rejects Climate-Focused Shareholder Derivative Suit", "content": "\n[This post was first published in the Oxford Business Law Blog] In a closely watched litigation in the climate change space, ClientEarth, a non-profit environmental law organisation based in the United Kingdom, instituted a shareholder derivative suit against the directors of Shell plc. The claim is based on the allegation that the directors breached their duties under the Companies Act 2006 by...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Supreme Court Ruling: Admission of Corporate Insolvency a Norm, Rejection an Exception", "content": "\n[Megha Maiti and Subhasmita Routray are legal counsels at Mercedes-Benz Financial Services India Private Limited] Section 7(5) of the Insolvency and Bankruptcy Code, 2016 (IBC) lays down the power of the National Company Law Tribunal (NCLT) to either accept or reject an insolvency application filed by a financial creditor. The issue of whether the said power is mandatory or discretionary in...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "SEBI’s Regulatory Focus: Examining AIF Investors’ Excuse And Exclusion Rights", "content": "\n[Shreya Singh is a 5th year B.B.A., LL.B. (Hons.) student at National Law University, Odisha in Cuttack, Odisha] Over the past decade, the alternative investment funds (“AIFs”) regime (which structures in the private equity and venture capital investment) in India, has experienced substantial expansion. Private equity investments in India reached a cumulative value of $44 billion between 2015 and...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "SEBI’s Circular on Transition Bonds: Can it Combat Greenwashing?", "content": "\n[Vatsal Jain and Vedant Bhardwaj Singh are 3rd year B.A., LL.B. (Hons) students at Hidayatullah National Law University] On 4 May 2023, the Securities and Exchange Board of India (‘SEBI’), by way of a circular titled ‘Additional requirements for the issuers of transition bonds’ (‘Circular’) laid down certain additional compliance measures for the issuance of transition bonds to prevent the...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Position of a Seller of an Immovable Property under the Insolvency and Bankruptcy Code, 2016", "content": "\n[Lavanya Pathak and Pallavi Mishra are advocates practicing in the Delhi High Court] Under the Insolvency and Bankruptcy Code, 2016 (“IBC”), there is a clear scheme of categorization of creditors for the purpose of initiation of the corporate insolvency resolution process (“CIRP”). This categorization lies at the core of the waterfall mechanism for distribution of assets prescribed under section...\n", "timestamp": "2023-09-29T16:30:01.969464"}, {"title": "Shareholder Protection under IBC: A Myth or a Possibility", "content": "\n[Dhruv Kohli is a 4th year B.A.LLB student and Sanya Singh a 4th year B.S.W LLB student, both at Gujarat National Law University] Ever since the enactment of the Insolvency and the Bankruptcy Code, 2016 (IBC), there has been a shift in the debt resolution mechanism in India. Unlike its predecessors, the IBC is a creditor-centric legislation, which can be ascertained from the fact that once there...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Reevaluating the Independence of Credit Rating Agencies: Time for Stricter Norms?", "content": "\n[Akanksha Dutta is a final year student of the 3-year LLB course at Government Law College, Mumbai] Credit Rating Agencies (“CRAs”) in India play a very vital role in determining the overall financial health of a company as well as the safety of the securities issued by such companies. The assessments made by CRAs assist investors, both large and small, in evaluating the risk linked to the...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Perpetuating an Anomaly: What is the “Prescribed Period” for Challenging an Arbitral Award?", "content": "\n[Rhythm Buaria is an advocate practicing commercial and matrimonial disputes before courts in Delhi] The Supreme Court in Bhimashankar Sahakari Sakkare Karkhane Niyamita v. Walchandnagar Industries Ltd. (WIL) held that a challenge to an arbitral award under section 34 of the Arbitration and Conciliation Act, 1996 cannot be entertained under the proviso to section 34(3) even if the 30-day period...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Constitutionality of Section 327(7) of the Companies Act 2013: Sanctity of the Waterfall Mechanism", "content": "\n[Simran Malhotra is an Associate at Shardul Amarchand Mangaldas, New Delhi] In Moser Baer Karamchari Union v. Union of India (2 May 2023), workmen unions challenged the constitutionality of section 327(7) of the Companies Act (“Act”) for excluding preferential payment for workmen’s dues over other dues as provided under sections 326 and 327 of the Act in the event of liquidation of a company...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "The Remedy for a Corporate Break-Up: A Framework for Cross-Border Demergers in India", "content": "\n[Ishika Garg is a 4th year B.A., LL.B. (Hons.) student at the NALSAR University of Law] Navigating the legalities associated with cross-border demergers (‘CBDs’) has always been a tricky task. The Indian position on this subject has been especially muddled, with a lack of sufficient clarity from both the legal enactments and judicial forums. A post on this Blog has previously noted how the...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Navigating India’s Green Taxonomy: Charting a Course for the Future", "content": "\n[Manvi Khanna is a Research Fellow at Vidhi Centre for Legal Policy and Hitoishi Sarkar a fifth-year law student at Gujarat National Law University. This post first appeared as an article in the Deccan Herald] The G20’s Sustainable Finance Working Group’s recent emphasis on the need to establish a green finance ecosystem has brought to the limelight the challenges that impede India’s green...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Cross-Border Merger Framework in India: Limited Efficacy?", "content": "\n[Rajat Sethi (Partner), Sumit Bansal (Partner) and Oshika Nayak (Associate) are at S&R Associates] The Ministry of Corporate Affairs (“MCA”) notified section 234 of the Companies Act, 2013, as amended (the “Companies Act”), and rule 25A of the Companies (Compromises, Arrangements and Amalgamations) Rules, 2016, as amended (the “Companies Merger Rules”), on April 13, 2017, to permit merger and...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Denying Input Tax Credit to Bona Fide Recipients Where GST is Not Paid by the Supplier", "content": "\n[Shubham Sharma is a 2nd year BBA LLB (Hons.) law student at Chanakya National Law University] A key distinction between GST and the pre-GST tax regime is that GST promises to eliminate the “cascading effect of taxes” or “tax on tax” that sellers often suffer from. Input tax credit (ITC) under GST is one such core concept that furthers this objective. ITC is the tax that a business pays on a...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Call for Papers: 11th Securitisation Summit 2023", "content": "\n[Announcement on behalf of the Indian Securitisation Foundation] Indian Securitisation Foundation invites researchers, law students and legal scholars to write original and unpublished research paper (5 pages to 15 pages) on any of the following topics, of relevance to securitisation/direct assignment and similar structured finance topics in Indian context, with a global flavour. Bankruptcy...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Interpretation of DTAAs: A Special Case of Explicitly Applying Vienna Convention for Treaty Interpretation", "content": "\n[Shantanu Singh is a 4th year B.A., LL.B. (Hons.) student at Dharmashastra National Law University, Jabalpur] In India, international treaties are not immediately incorporated into domestic law. Under the “dualism” approach, separate legislation is necessary for India to execute treaty-based international law. Treaties, according to Indian courts, are part of public international law and thus are...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "“Private Placement”: Syntactic Interpretation of a Financing Engagement Letter", "content": "\nRecently, the England and Wales High Court (Commercial Court) had the occasion in Cantor Fitzgerald & Co. v. Yes Bank Limited [2023] EWHC 745 (Comm) (31 March 2023) to consider contractual language in capital market transactions. While the contract itself was governed by English law, the ruling has implications on contractual interpretation more generally, in addition to its relevance to...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Preserving the IBC’s rationale: The Tussle with the Benami Act", "content": "\n[Rohan Srivastava and Rupam Dubey are currently B.A., LL.B. (Hons.) students at the National Law School of India University, Bengaluru]  Presently, the Supreme Court is considering an appeal in the C Ramasubramaniam Liquidator v. Deputy Commssioner of Income Tax (Benami Prohibition) , which will potentially establish the extent to which the Insolvency and Bankruptcy Code (‘IBC’), [year] is given...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Unraveling “Materiality” in SEBI’s Consultation Paper: Legal Perspectives and Recommendations", "content": "\n[Shantanu Dhingra is a 3rd year law student at the National Law University Odisha] The Securities and Exchange Board of India (SEBI) on 20 February 2023 released a consultation paper focused on streamlining disclosures by listed entities, intending to strengthen compliance with the SEBI Listing Obligations and Disclosure Requirements Regulations, 2015. Central to this post is the notion of...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Liability of Authorized Signatory of a Company to Pay Interim Compensation Under the Negotiable Instruments Act, 1881", "content": "\n[Khush Bhachawat is a III year B.A., LL.B. (Hons.) student at NALSAR University of Law, Hyderabad] The Bombay High Court (“HC”) recently held that authorised signatory of a company who signs a cheque on its behalf is not a ‘drawer’ of the cheque and hence is not liable to pay interim compensation under section 143A of the Negotiable Instruments Act, 1881 (“NI Act”) in a case of...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Promissory Estoppel Revisited: Comment on State of Jharkhand v. Brahmputra Metallics Ltd.", "content": "\n[Kaustav Saha is a Lecturer at Jindal Global Law School. His research interests include private law and legal theory.] The doctrine of promissory estoppel has had a somewhat unprincipled evolution in Indian law, particularly in its relation to the doctrine of consideration and, more pertinently to this post, in its role and character as a public law remedy. In this context, the case of State of...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Analyzing Directors’ Duty of Care under the Companies Act, 2013", "content": "\n[Rishabh Mohnot is a lawyer working in Mumbai and Hrithik Merchant a law student at the National Law School of India University, Bangalore] With the increasing proliferation of companies and their influence, there is a growing need to understand the responsibilities vested on their decision-makers. The Companies Act, 2013 (“2013 Act”) places a duty of care on the key decision-makers in a company...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "How Will Courts Decide in Bond Holders versus Central Banks?", "content": "\n[Bhargavi Zaveri Shah a doctoral researcher at the Faculty of Law, National University of Singapore and an editor of IndiaCorpLaw Blog and Harsh Vardhan is a management consultant] The Supreme Court is currently hearing an appeal against a Bombay High Court judgement on Yes Bank’s restructuring plan. The question at hand in this appeal is this: whether, as part of Yes Bank’s restructuring...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Breaking the Rules: When Crowdfunding Platforms Cross the Line in Raising Capital", "content": "\n[Mohammad Kaif is a penultimate year student at Campus Law Centre, Faculty of Law, University of Delhi] Crowdfunding has become increasingly popular as a way to raise funds, where numerous individuals invest in a project or a company, usually via an internet-based platform. Some companies have used crowdfunding platforms to issue securities in violation of the provisions of Private Placement...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Dilemma Surrounding Assignment of Not Readily Realisable Assets (‘NRRA’) under the IBC", "content": "\n[Rohit Sharma is a Partner at Mamta Binani & Associates, Mumbai] By way of a notification dated 13 November 2020, the Insolvency and Bankruptcy Board of India (‘IBBI’) inserted regulation 37A to the Insolvency and Bankruptcy Board of India (Liquidation Process) Regulations, 2016 (‘Liquidation Process Regulations’), which states as follows: “37A.  Assignment of not readily realisable assets. A...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Reassessing the Validity of Dawn Raid in Light of French Supermarket Judgment", "content": "\n[Shubham Gandhi and Sreeya Sengupta are students at NLU Jabalpur & Nirma Law Institute respectively.] The Competition Act, 2002 (“Act”) vide section 41 grants the power to the Director General (“DG”) to carry out dawn raids, i.e., a sudden, unannounced raid on the company’s offices to seize relevant documents to corroborate the investigation. This power has been largely unguided and...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Call for Papers: 3rd RGNUL-SAM Conclave on Emerging Trends in Banking & Finance in India, 2023", "content": "\nThe Rajiv Gandhi National University of Law, Punjab (RGNUL) is an autonomous National Law University (NLU) established by the RGNUL Act (No. 12 of 2006) passed by the Legislature of the State of Punjab, under the second wave of reforms instituted by the Bar Council of India. Established in 2006, RGNUL has garnered a pan-India reputation as a stellar institution for legal research and education...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "SEBI’s Proposals to Enhance Corporate Governance by Empowering Shareholders", "content": "\nOver the last decade and, in particular, following the enactment of the Companies Act, 2013, the Securities and Exchange Board of India (SEBI) has been gradually and consistently strengthening the governance norms pertaining to listed companies. Among other measures, SEBI has sought to focus on two specific matters, viz., (i) enhancing transparency in corporate matters; and (ii) empowering...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Debenture Holders’ Right to Object to Material Related Party Transactions", "content": "\n[Vinita Nair is a Senior Partner at Vinod Kothari & Company] The Securities and Exchange Board of India (‘SEBI’) continues to tighten the regulatory regime for debt-listed entities as it aims to promote the corporate bond market. After equating debt-listed entities with outstanding value of listed non-convertible debt securities of Rs. 500 crore and above with equity-listed entities for the...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Modification v. Partial Setting Aside – Whether Two Sides of the Same Coin?", "content": "\n[Pallavi Mishra and Drishti Rajain are advocates practicing in the Delhi High Court] While the law has been settled by the Supreme Court (“SC”) in The Project Director, National v. M Hakeem (“M. Hakeem”) and affirmed in NHAI v. P. Nagaraju (“P. Nagaraju”) with respect to the lack of court’s jurisdiction to “modify” an arbitral award, the recent line of judgements rendered by the High Courts...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "Taking away the Attorney-Client Privilege: Competition Amendment Bill, 2022", "content": "\n[Shubham Gandhi is a 5th year student at NLU, Jabalpur and Hricha Gandhi is an Advocate at Rajasthan High Court] The concept of Attorney-Client privilege (“ACP’’) has become one of the quintessential principles across all global jurisdictions. It simply enunciates that the communication made by the client to its attorney during the course of employment or any document shared will be inadmissible...\n", "timestamp": "2023-09-29T16:30:02.436961"}, {"title": "The Constitutional Validity of Deeming Fictions Under the GST Law", "content": "\n[Prakruthi Jain is a 3rd year B.A., LL.B. (Hons.) student at NALSAR University of Law, Hyderabad] The Goods and Services Tax (“GST”) was introduced by the 101st Amendment Act in 2016. This was followed by the introduction of the four Acts, i.e., the Central Goods and Services Tax Act (“CGST”), the Integrated Goods and Services Act (“IGST”), the Union Territories Goods and Services Tax Act (UTGST)...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Rethinking Interest on TDS/ TCS Credit under GST Law in India: Part 2", "content": "\n[Manohar Samal is an Associate Advocate at Ratan Samal & Associates, Mumbai and a Panel Arbitrator at the Indian Institute of Arbitration and Mediation. This is continued from Part 1] Current Mechanism for Levy of Interest Now that the basic outline of the GST law in India has been discussed, the manner of levy of interest under the GST statutes can be discussed. The CGST Act, 2017 envisages...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Rethinking Interest on TDS/ TCS Credit under GST Law in India: Part 1", "content": "\n[Manohar Samal is an Associate Advocate at Ratan Samal & Associates, Mumbai and a Panel Arbitrator at the Indian Institute of Arbitration and Mediation] The concept of interest under tax law has been one of the most significant sources of compensating the Government treasury for non-compliance with tax statutes in India. The most common forms of non-compliance for which interest is levied on...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Identification of Related Parties of Subsidiaries", "content": "\n[Aisha Begum Ansari is a Manager at Vinod Kothari and Company] The provisions pertaining to related party transactions (RPT) under the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 (the ‘LODR Regulations’) were substantially amended by the Securities and Exchange Board of India (SEBI) on November 9, 2021. Pursuant to the amendments, the definitions of a related party...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Bombay High Court Reiterates Distinction Between Forward Contracts and Options in Securities", "content": "\nThe distinction between a forward contract for sale and purchase of securities in a company on the one hand and the creation of an option in relation to such securities on the other hand bears considerable relevance when it comes to their enforceability. While the Securities Contracts (Regulations) Act, 1956 (SCRA) and various notifications issued therein by the Central Government as well as the...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Liability of Company Secretary for Misstatements: SC Remits Case to SAT", "content": "\nIn November 2022, we had discussed a somewhat curious ruling of the Securities Appellate Tribunal (SAT) in V. Shankar v. Securities and Exchange Board of India which exonerated the Company Secretary of Deccan Chronicle Holdings Limited (DHCL) from liability for certain misstatements and incorrect disclosures made by the company. We had noted that the SAT largely arrived at the ruling on first...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Necessity of Judicial Member in the CCI: NCLAT’S Perplexing Piece of the Puzzle", "content": "\n[Shourya Mitra is a penultimate year law student at Jindal Global Law School, Sonipat] Recently, the National Company Law Appellate Tribunal (NCLAT) dismissed the appeals filed by United Breweries and others against the order of the Competition Commission of India (CCI) (Beer Cartel Case). The CCI had held that the beer companies were in contravention of the provisions of the Competition Act 2002...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Imposition of an Interim Moratorium Prior to Corporate Insolvency Resolution Process", "content": "\n[Sumer Karekar is a lawyer and is presently undergoing the Graduate Insolvency Programme at the Indian Institute of Corporate Affairs, Gurgaon] The Insolvency and Bankruptcy Code, 2016 (“IBC”) has sought to implement a time-bound framework for resolution of stressed companies. For this purpose, it prescribes a timeline for the adjudicating authority (“AA”) to admit or reject an application for...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Derivative Action – Where Does the Jurisdiction Lie?", "content": "\n[Pratyush Singh is a third-year student at the National Law School of India University, Bangalore] Does the National Company Law Tribunal (NCLT) have exclusive jurisdiction over matters pertaining to derivative action? In November 2022, the Madras High Court in Valluvar Kuzhumam Pvt. Ltd. v. APC Drilling & Construction Pvt. Ltd. ruled in the affirmative. The argument to bar a civil court’s...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Bombay High Court’s ASREC Ruling: Form v. Substance in SARFAESI Proceedings", "content": "\n[Sharanya Shivaraman  is an Advocate practicing in Mumbai and a graduate of ILS Law College, Pune] The Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 was enacted over two decades ago to facilitate loan recovery and the securitisation of financial assets of banks and financial institutions. Under the framework of the Act, section 13 is a key...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Resolving the Conundrum Surrounding Applicability of Moratorium under Section(14)(1)(a) of IBC", "content": "\n[Kanishka Aswal and Ritik Jhanwar are III year students at the Gujarat National Law University, Gandhinagar. This post was first published here] One of the ultimate goals of the Insolvency and Bankruptcy Code, 2016 (“IBC”) is to provide a mechanism for the timely resolution of a corporate debtor’s insolvency in order to maximize the value of its assets, to facilitate credit facility and to...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "NCLAT’s Pronouncement in the DLF Case: An Unwarranted Restriction on the Commission’s Powers", "content": "\n[Shourya Mitra is a penultimate year law student at Jindal Global Law School, Sonipat] Recently, the National Company Law Appellate Tribunal (NCLAT) in the case of Amit Mittal v. DLF Ltd Competition Appeal (AT) No.82 of 2018 (DLF case),  passed an order remitting a case against DLF, back to the Competition Commission of India (CCI) on account of the Commission’s order being void. The reason was...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Supreme Court Reiterates Rectificatory Jurisdiction Under Companies Act: A Conundrum Involving NCLT and SEBI", "content": "\n[Anshita Dave and Abhyudaya Yadav are 5th year B.A., LL.B. (Hons.) students at Dharmashastra National Law University, Jabalpur] Recently, the Supreme Court in IFB Agro Industries Limited v. SICGIL India Limited held that the National Company Law Tribunal (“NCLT”) cannot exercise its rectificatory jurisdiction under section 59 of the Companies Act, 2013 (“the Act”) to...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "The Bombay High Court’s Yes Bank Judgement: Falling Short on Fairness", "content": "\n[Harsh Vardhan is a management consultant and Bhargavi Zaveri Shah a doctoral researcher at the Faculty of Law, National University of Singapore and an editor of IndiaCorpLaw Blog] Last week, the Bombay High Court set aside the Reserve Bank of India (RBI)-appointed administrator’s decision to write off the additional tier (AT1) bonds issued by Yes Bank in 2016 and 2017. In 2020, when a...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Mutual Funds, Insider Trading and the Myth of Sisyphus", "content": "\n[Shruti Rajan is a partner at Trilegal] In Greek mythology, the gods condemned Sisyphus to an endless cycle of rolling a boulder up a hill, have it roll down and then start again. A parable of the interminable, eternal human struggle against the diktat of the gods, the fate of Sisyphus has long served as a metaphor for the repetitive and dogged demands of modern life and business. Introducing a...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "The Singapore Court of Appeal on Arbitrability and the Proper Law of Arbitration Agreements", "content": "\nIn its recent judgment Mittal v Westbridge Ventures, the Singapore Court of Appeal has considered a number of important questions of arbitration law concerning the proper law of arbitration agreements and the identification of the law which determines whether a particular dispute is arbitrable. The case is likely to be of particular interest to Indian practitioners because it illustrates why in...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Call for Submissions: CCL Blog", "content": "\n[Announcement on behalf of the Centre for Corporate Law, National Law University Odisha] The CCL Blog is a two-tier peer-reviewed blog affiliated with the Centre for Corporate Law, National Law University Odisha. The blog aims to foster discourse by encouraging noble and unique literature on Corporate and allied Commercial Laws. Hence, we ensure a thorough review within a short deadline. Review...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Designing a Framework for Disclosures of “Market Rumors” under the LODR Regulations", "content": "\n[Harsh N Dudhe is a IV year student at NALSAR University of Law, Hyderabad] Much has already been said (here and here) about the pitfalls of the mandate proposed by the Securities and Exchange Board of India (SEBI) on top 250 listed companies to confirm or deny market rumors, as part of the continuous disclosure mechanism. The major criticism is that such disclosures would premature and may...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Does the expression “charges” always include demurrage? Supreme Court answers in the negative", "content": "\n[Raghav Bhatia is an advocate, practising at the Supreme Court and Delhi High Court, and Mahima Tahiliani is a third-year law student at UPES Dehradun] Recently, in Food Corporation of India v. Abhijit Paul, the Supreme Court of India [‘SC’] has observed that the expression “charges” does not include demurrage ipso facto and the same has to be determined in light of the terms of contract between...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Online Certificate Course: Evolving Paradigms of Insolvency and Bankruptcy Code, 2016", "content": "\n[Announcement on behalf of the Centre for Insolvency and Bankruptcy Studies, National Law University Jodhpur] The Centre for Insolvency and Bankruptcy Studies, National Law University Jodhpur, is organising a Three-Day Online Certificate Course on ‘Evolving Paradigms of Insolvency and Bankruptcy Code, 2016’ in collaboration with the Insolvency and Bankruptcy Board of India from 25 February 2023...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "The Regulatory Progression of ESG in India", "content": "\nThe concept of corporate social responsibility (CSR) has had a pivotal status in the debates surrounding corporate law and governance at the turn of the century. Although CSR was ensconced in the idea of voluntarism by which companies and their boards are invited to pay attention to the interests of various constituencies affected by a company’s activities, in some jurisdictions such as India it...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Government AI Procurement in India: Can WEF Guidelines Solve the Latency?", "content": "\n[Jishnu M Nair is a Senior Attorney at IBM] With a score of 63.67, India is at the 32nd position in the Government AI readiness Index 2022, issued by Oxford Insights. The index symbolizes that India is more policy-ready than Brazil and Greece, and less policy-ready than China and Malaysia. Although 32 might not be a desirable rank, for a developing nation to be in the first 25% of the countries...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Schrems II: Data Flow to Trusted Jurisdictions and Implications for India", "content": "\n[Intisar Aslam is a 2nd Year B.A., LL.B. (Hons.) student at the National University of Study and Research in Law in Ranchi] The much-awaited Digital Personal Data Protection Bill, 2022 (“DPDP”), released by the Ministry of Electronics and Information Technology (“Meity”), has received mixed reactions from the legal fraternity. Previously, the Data Protection Bill, 2022 (“DPB”) was withdrawn owing...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "SEBI’s Proposed Disclosure Regime: Impact on Public M&A and Directors’ Liabilities", "content": "\n[Shivam Yadav, Amudavalli Kannan, and Shreyas Bhushan are with Resolut Partners] Institutional investors, listed companies, and retail shareholders – three key market participants – will be watching SEBI with eagle-eyes while it attempts to implement a new disclosure regime, as set out in its recent consultation paper (Consultation Paper). Most of SEBI’s proposals are well-intentioned and...\n", "timestamp": "2023-09-29T16:30:02.912614"}, {"title": "Relaxation for Flip Structures under the New Overseas Investment Regime", "content": "\n[Shubh Gautam is a fourth year B.A.LL.B (Hons) student at Chanakya National Law University, Patna] Indian startups and new age companies are jumping on the bandwagon of ‘flipping’ their business. This trend has been addressed by the Foreign Exchange Management (Overseas Investment) Rules, 2022 issued on August 22, 2022 (forming a part of the new overseas investment regime). The new overseas...\n", "timestamp": "2023-09-29T16:30:02.912614"}]